In [2]:
import pandas as pd
df = pd.read_csv("Titanic.csv")
df.head()

,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",2,female,22.0,1,2,SC/Paris 2123,41.5792,NaN,C,1
1,"Shutes, Miss. Elizabeth W",1,female,40.0,0,0,PC 17582,153.4625,C125,S,1
2,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",3,female,39.0,1,5,347082,31.2750,NaN,S,0
3,"Jardin, Mr. Jose Neto",3,male,NaN,0,0,SOTON/O.Q. 3101305,7.0500,NaN,S,0
4,"Murphy, Miss. Margaret Jane",3,female,NaN,1,0,367230,15.5000,NaN,Q,1

In [3]:
print(df.columns)

Index(['Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [4]:
df.drop(['Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age      Fare  Survived
0       2  female  22.0   41.5792         1
1       1  female  40.0  153.4625         1
2       3  female  39.0   31.2750         0
3       3    male   NaN    7.0500         0
4       3  female   NaN   15.5000         1

In [5]:
target = df['Survived']
inputs = df.drop('Survived', axis = 'columns')

In [6]:
dummies = pd.get_dummies(inputs['Sex'])
dummies.head(3)

   female  male
0       1     0
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies], axis = 'columns')
inputs.head(4)

   Pclass     Sex   Age      Fare  female  male
0       2  female  22.0   41.5792       1     0
1       1  female  40.0  153.4625       1     0
2       3  female  39.0   31.2750       1     0
3       3    male   NaN    7.0500       0     1

In [8]:
inputs.drop('Sex', axis = 'columns', inplace = True)
inputs.head(3)

   Pclass   Age      Fare  female  male
0       2  22.0   41.5792       1     0
1       1  40.0  153.4625       1     0
2       3  39.0   31.2750       1     0

In [17]:
inputs.isna().any()  # used to check null values in columns method 1

Pclass    False
Age       False
Fare      False
female    False
male      False
dtype: bool

In [10]:
inputs.columns[inputs.isna().any()]   # used to check null values in columns method 2

Index(['Age'], dtype='object')

In [11]:
age_avg = inputs.Age.mean()
age_avg

29.453717948717948

In [12]:
inputs.Age.fillna(age_avg, inplace = True)
inputs.tail(2)

     Pclass   Age   Fare  female  male
281       1  26.0  30.00       0     1
282       3  32.0   7.75       0     1

In [13]:
inputs.isna().any()

Pclass    False
Age       False
Fare      False
female    False
male      False
dtype: bool

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.3)

In [16]:
model = GaussianNB()

NameError: name 'GaussianNB' is not defined

In [ ]:
model.fit(X_train, y_train)

In [ ]:
model.predict(X_test)

In [ ]:
model.score(X_test, y_test)